---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PipingFailures.DuctPipeSizeMismatch
source: html/a7f8ebb9-def8-67bf-34e2-31992fa67173.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PipingFailures.DuctPipeSizeMismatch Property

The duct/pipe size is invalid for the service definition

## Syntax (C#)
```csharp
public static FailureDefinitionId DuctPipeSizeMismatch { get; }
```